app/Services/Backend/ProductService.php

select * from `products` limit 10 offset 20
select count(*) as aggregate from `products`
---
    public function getAllProduct()
    {
        return Product::with('images')->paginate(Product::ITEMS_PER_PAGE);

insert into `products` (`name`, `product_type_id`, `price`, `code`, `quantity`, `updated_at`, `created_at`) values ('nike', 1, '400000', '87878787', '15', '2019-11-27 08:37:33', '2019-11-27 08:37:33')
insert into `product_images` (`product_id`, `url`, `updated_at`, `created_at`) values (50, 'd.jpg', '2019-11-27 08:37:33', '2019-11-27 08:37:33')
---
    public function createProduct($request)
    {
        $product = new Product;
        $product->name = $request->name;
        $product->product_type_id = 1;
        $product->price = $request->price;
        $product->code = $request->code;
        $product->quantity = $request->quantity;
        $product->save();
        $product_id = $product->id;
        $productImage = new ProductImage;
        $productImage->product_id = $product_id;
        $productImage->url = $request->image;
        $productImage->save();